Tekla Open API Reference for Tekla Structures 2025
SpiralBeam Constructor (Point, Point, Double, Double)
 Initializes a new instance of the SpiralBeam class with the given parameters. Rotation axis direction is current positive Z direction.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SpiralBeam(
	Point startPoint,
	Point rotationAxisPoint,
	double totalRise,
	double rotationAngle
)
Public Sub New (
	startPoint As Point,
	rotationAxisPoint As Point,
	totalRise As Double,
	rotationAngle As Double
)
Parameters
startPoint
Type: Tekla.Structures.Geometry3d.Point
The spiral beam starting point.
rotationAxisPoint
Type: Tekla.Structures.Geometry3d.Point
A point on the spiral beam rotation axis.
totalRise
Type: System.Double
The difference between the spiral beam start and end point along the rotation axis direction.
rotationAngle
Type: System.Double
The spiral beam cumulative rotation angle.
See Also
Reference
SpiralBeam Class
SpiralBeam Overload
Tekla.Structures.Model Namespace